# 开源许可证

Tgo 基于修改版的 Apache License 2.0 进行授权，并附加以下条款：

1. Tgo 允许用于商业用途，包括作为客服系统集成到其他应用或为企业提供客服解决方案。但若出现以下情况，必须从 Tgo 生产者处获取商业许可：

a. 多租户服务：除非获得 Tgo 书面明确授权，否则不得使用 Tgo 源代码运营多租户环境。
    - 租户定义：在 Tgo 中，一个租户对应一个独立的公司或组织。默认开源版本仅支持单一公司使用，禁止通过用户注册、订阅或其他方式让多个公司或组织在同一个 Tgo 实例中独立使用。

b. 品牌标识与版权信息：在使用 Tgo 前端时，不得移除或修改 Tgo 控制台或应用中的品牌标识及版权信息。此限制不适用于不涉及 Tgo 前端的场景。
    - 前端定义：本许可中"前端"包括位于 `repos/tgo-web` 和 `repos/tgo-widget-js` 目录下的所有组件，或对应的 Docker 镜像。

2. 作为贡献者，您同意：

a. Tgo 生产者有权根据需要，调整本开源协议至更严格或更宽松的版本。
b. 您贡献的代码可能被用于商业用途，包括但不限于 Tgo 的云业务运营。

除上述特定条款外，其余权利与限制均遵循 Apache License 2.0。Apache License 2.0 详细内容请见：http://www.apache.org/licenses/LICENSE-2.0。

本产品的用户界面设计受外观设计专利保护。

© 2025 上海信必达科技有限公司 Inc. 保留所有权利。